#Пользователь вводит предложение, заменить все пробелы на "-" 2-мя  способами

text: str = 'first friday'
print(text.replace(' ','-'))

a=' '
if a in text:
    text=text.replace
print(text)




