# Найти 2 5-ти значных делителя
# числа 1522605027922533360535618378132637429718068114961380688657908494580122963258952897654000350692006139
N = 1522605027922533360535618378132637429718068114961380688657908494580122963258952897654000350692006139
# делители находятся в диапазоне от 10 000 до 99 999
for d in range (10000, 99999):
    if N % d == 0 :
        print (d, ' ', sep = '', end = '')
else:
    print('нет в этом диапазоне делителей')

# вариант решения через функцию
def divisors_for_num(our_num):
    result = []
    for i in range(10000, 999999):
        if our_num % i == 0:
            result.append(i)
            result.append(our_num)
    return result
print(divisors_for_num(1522605027922533360535618378132637429718068114961380688657908494580122963258952897654000350692006139))


